{"observation": "Cracks visible along the left front track roller, metal stress lines extending 2 inches", "component": "Front Track Roller", "part_number": "1255714", "severity": "ASAP", "rationale": "Cracked roller can collapse under operational load causing sudden track derailment and machine tipping", "recommended_action": "Remove machine from service immediately. Replace front track roller before next operation.", "manual_reference": "D6N Operation Manual p.84 - Undercarriage Inspection"}
{"observation": "Oil seep around final drive seal, light film coating visible on housing", "component": "Final Drive Seal", "part_number": "9W2367", "severity": "Soon", "rationale": "Minor seal weep indicates early seal degradation. Not yet at risk of failure but will worsen under continued operation", "recommended_action": "Schedule final drive seal replacement within 50 service hours. Monitor oil level daily.", "manual_reference": "D6N Service Manual - Final Drive Maintenance"}
{"observation": "Blade cutting edge worn but still within spec, uniform wear pattern across entire edge", "component": "Blade Cutting Edge", "part_number": "4T5600", "severity": "Okay", "rationale": "Cutting edge within acceptable wear limits. No structural damage observed.", "recommended_action": "Continue monitoring. Plan replacement at next scheduled PM.", "manual_reference": "D6N Maintenance Manual - Blade Wear Specs"}
{"observation": "Hydraulic cylinder rod shows scoring marks and pitting on chrome surface, 3 inch section affected", "component": "Blade Tilt Cylinder Rod", "part_number": "3G4928", "severity": "ASAP", "rationale": "Rod scoring damages seals on every stroke, causing accelerating hydraulic fluid loss and loss of blade control", "recommended_action": "Remove machine from service. Replace cylinder rod and seals before next operation.", "manual_reference": "D6N Service Manual - Hydraulic Cylinder Inspection"}
{"observation": "Track tension slightly loose, sag measurement 2.5 inches at mid-span", "component": "Track Assembly", "part_number": null, "severity": "Soon", "rationale": "Track sag exceeds recommended 1.5-2 inch spec. Over-loose track increases wear on sprockets and rollers", "recommended_action": "Adjust track tension to spec before next shift. Recheck after 8 hours of operation.", "manual_reference": "D6N Operation Manual - Track Tension Adjustment p.52"}
